       01  SEGX-BALANCE-DUE.
           03 SEGX-PERIOD              PIC X(6).
           03 SEGX-SEQ                 PIC X(2).
           03 SEGX-CURRENT-BALANCE-DUE PIC 9(9)V99 COMP.
           03 SEGX-OVERDUE-IND         PIC X(1).
           03 SEGX-CUSTOMER-STATUS     PIC X(10).
           03 FILLER                   PIC X(53).
