      *   ---------------------------------------------------
      *   Sample COBOL Copybook for IBM PD Tools Workshops
      *   Describes file <userid>.ADLAB.FILES(FMTABLE)
      *   ---------------------------------------------------
           05  CUST-ID               PIC X(5).
           05  FILLER                PIC X(5).
           05  CUST-ID-SCRAMBLED     PIC X(5).
           05  FILLER                PIC X(65).
