       01  SEGE-OFF-PRIME-DETAIL.
           03 SEGE-TIME-START          PIC X(8).
           03 SEGE-TIME-END            PIC X(8).
           03 SEGE-OFF-PRIME-USED      PIC 9(9)V99   COMP.
           03 SEGE-OFF-PRIME-RATE      PIC 9(5)V9(4) COMP.
           03 SEGE-OFF-PRIME-TOTAL-DUE PIC 9(9)V99   COMP.
           03 FILLER                   PIC X(44).
