       01  SEGD-OFF-PRIME-USAGE.
           03 SEGD-PERIOD              PIC X(6).
           03 SEGD-SEQ                 PIC XX.
           03 SEGD-OFF-PRIME-TOTAL     PIC 9(9)V99   COMP.
           03 SEGD-OFF-PRIME-TOTAL-DUE PIC 9(9)V99   COMP.
           03 SEGD-OFF-PRIME-AVG-RATE  PIC 9(5)V9(4) COMP.
           03 FILLER                   PIC X(52).
