       01  SEGC-PRIMARY-USE.
           03 SEGC-PERIOD           PIC X(6).
           03 SEGC-SEQ              PIC 9(2).
           03 SEGC-PRIME-TIME-USAGE PIC 9(9)V99.
           03 SEGC-PRIME-TIME-RATE  PIC 9(5)V9(4).
           03 FILLER                PIC X(52).
