        01  LINKAGE-VALUES.
            05  VAL-NUMERIC-1           PIC S9(1).
            05  VAL-NUMERIC-2           PIC S9(1).
            05  VALUE-RESULT            PIC S9(2).
            05  MATH-OP                 PIC X(1).
            05  RETC                    PIC S9(4).
