       01  SEGB-TOTAL-USAGE.
           03 USAGE-PERIOD.
              05 USAGE-YEAR          PIC X(4).
              05 USAGE-MONTH         PIC X(2).
           03 ACCOUNT-INV-SEQ        PIC X.
           03 ACCOUNT-TOTAL-USAGE    PIC 9(9)V99 COMP-3.
           03 CURRENT-PERIOD-AMT-DUE PIC 9(7)V99 COMP-3.
           03 COMPLAINTS             PIC X(62).
